// Напишите программу, которая принимает на вход число (А)
// и выдает сумму чисел от 1 до А
// int Sum(int A) {
//     int sum = 0;
//     for (int i=1; i <= A; i++){
//        sum = sum + i;
//     }
//     return sum;
// }
// Console.WriteLine(Sum(4));

// Напишите программу, которая выводит массив из 8 элементов, заполненных
// 0 и 1
// int[] GetMassive() {
//     int[] x = new int[8];
//     for (int i =0; i < x.Length; i++) {
//         x[i] = new Random().Next(0,2);
//     }
//     return x;
// }
// void Getter(int[] ints) {
//     for (int i =0; i<ints.Length; i++){
//         Console.Write($"{ints[i]} ");
//     }
// }
// Getter(GetMassive());
